---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightSourceLength
source: html/2dfd5732-8d15-da4e-9dfa-387254d83a08.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightSourceLength Property

"Light Source Symbol Length"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightSourceLength { get; }
```